//==========================================================
//文件名称：Beep.c
//文件描述：蜂鸣器控制程序
//文件版本：Ver1.0
//创建日期：2014.09.28
//修改日期：2014.10.28 11:01
//文件作者：
//备注说明：无
//注意事项：无
//==========================================================
//#include "TypeDefine.h"
//#include "GlobalValue.h"
//#include "Hardware.h"
//#include "Beep.h"
#include "pbdata.h"
//==========================================================
//静态变量
static u8 gtickon;	//开周期
static u8 gtickoff;	//关周期
static Beep_TypeDef Beep;	//蜂鸣器结构体

//==========================================================
//函数名称：Beep_Init
//函数功能：初始化蜂鸣器
//入口参数：无
//出口参数：无
//创建日期：2011.03.19
//修改日期：2014.04.04 11:48
//备注说明：无
//==========================================================
void Beep_Init(void)
{
	Beep.tick_on=0;
	Beep.tick_off=0;
	Beep.tick_work=0;
	Beep_Off();
}

//==========================================================
//函数名称：Beep_Work
//函数功能：蜂鸣器工作
//入口参数：无
//出口参数：无
//创建日期：2011.03.19
//修改日期：2014.04.04 11:48
//备注说明：应10mS定时调用
//==========================================================
void Beep_Work(void)
{
	if (Beep.tick_work)
	{
		if (gtickon)//开周期
		{
			gtickon--;
		}
		else if (gtickoff)//关周期
		{
			gtickoff--;
			Beep_Off();
		}
		else
		{
			Beep_Off();
			if (--Beep.tick_work)
			{
				gtickon=Beep.tick_on;
				gtickoff=Beep.tick_off;
				if (gtickon)Beep_On();
			}
		}
	}
//	else
//	{
//		Beep_Off();
//	}
}

//==========================================================
//函数名称：Beep_Update
//函数功能：更新蜂鸣器
//入口参数：无
//出口参数：无
//创建日期：2011.03.19
//修改日期：2014.04.04 11:48
//备注说明：无
//==========================================================
static void Beep_Update(u8 on_cyc,u8 tick_beep_on, u8 tick_beep_off)
{
	Beep.tick_on=tick_beep_on;
	Beep.tick_off=tick_beep_off;
	Beep.tick_work=(on_cyc==0x00)?0x01:on_cyc;//至少响一声
	gtickon=tick_beep_on;
	gtickoff=tick_beep_off;
	Beep_On();
}

//==========================================================
//函数名称：Beep_Long
//函数功能：蜂鸣器长响一声
//入口参数：无
//出口参数：无
//创建日期：2011.03.19
//修改日期：2014.04.04 11:48
//备注说明：无
//==========================================================
void Beep_Long(void)
{
	Beep_Update(1,TICKS_PER_SEC,0);//一声响响1S
}

//==========================================================
//函数名称：Beep_One
//函数功能：蜂鸣器响一声
//入口参数：无
//出口参数：无
//创建日期：2011.03.19
//修改日期：2014.04.04 11:48
//备注说明：无
//==========================================================
void Beep_One(void)
{
//	Beep_Update(1,TICKS_PER_SEC/10,0);//一声响100mS
	Beep_Update(1,TICKS_PER_SEC/8,0);//一声响125mS
}

//==========================================================
//函数名称：Beep_Two
//函数功能：蜂鸣器响两声
//入口参数：无
//出口参数：无
//创建日期：2011.03.19
//修改日期：2014.04.04 11:48
//备注说明：无
//==========================================================
void Beep_Two(void)
{
//	Beep_Update(2,TICKS_PER_SEC/8,TICKS_PER_SEC/16);//12.5mS+6.25ms响2声
	Beep_Update(2,TICKS_PER_SEC/6,TICKS_PER_SEC/16);//25mS+6.25ms响2声
}

//void Beep_Long(void)
//{
//	Beep_Update(1,0xffff,0);//一声响响1S
//}
//==========================================================
//END
//==========================================================
